// Задача: умната Лили
// Лили вече е на N години. За всеки свой рожден ден тя получава подарък. За нечетните рождени дни (1, 3, 5, …, n) 
// получава играчки, а за всеки четен (2, 4, 6, …, n) получава пари. За втория рожден ден получава 10.00 лв., като сумата се увеличава с 10.00 лв. 
// за всеки следващ четен рожден ден (2 -> 10, 4 -> 20, 6 -> 30 и т.н.). През годините Лили тайно е спестявала парите. Братът на Лили, в годините, 
// които тя получава пари, взима по 1.00 лев от тях. Лили продала играчките, получени през годините, всяка за P лева и добавила сумата към спестените пари. 
// С парите искала да си купи пералня за X лева. Напишете програма, която да пресмята колко пари е събрала и дали ѝ стигат да купи пералня.

// Входни данни
// Програмата прочита 3 числа (аргумента), въведени от потребителя, на отделни редове:

// Възрастта на Лили – цяло число в интервала [1 … 77].
// Цената на пералнята – число в интервала [1.00 … 10 000.00].
// Единична цена на играчка – цяло число в интервала [0 … 40].



function lili(age, price, toy) {
    let money = 0;
    let m = 0;
    for (let i = 1; i < age; i++) {
        if (i % 2 === 0) {
            m += 10;
            money += m - 1;
        } else {
            money += toy;
        }
    }
    return price < money ? `Yes ${money - price}! ` : `No? :( ${price - money}`;
}

console.log(lili(10, 170, 6))